samdonnelly/STM32F4-driver-test/sources/app_test/freertos_test.c
#if PERIODIC_BLINK_TEST 
    periodic_blink_init(); 
#elif MANUAL_BLINK_TEST 
    manual_blink_init(); 
#elif TASK_SCHEDULING_TEST 
    task_scheduling_init(); 
#elif MEMORY_MANAGEMENT_TEST 
    memory_management_init(); 
#elif QUEUE_TEST 
    queue_init(); 
#elif MUTEX_TEST 
    mutex_init(); 
#elif SEMAPHORE_TEST 
    semaphore_init(); 
#elif SOFTWARE_TIMER_TEST_0 
    software_timer_0_init(); 
#elif SOFTWARE_TIMER_TEST_1 
    software_timer_1_init(); 
#elif HARDWARE_INTERRUPT_TEST 
    hardware_interrupt_init(); 
#elif DEADLOCK_STARVATION_TEST 
    deadlock_starvation_init(); 
#elif PRIORITY_INVERSION_TEST 
    priority_inversion_init(); 
#endif
} 

//=======================================================================================


//=======================================================================================
// Test code 

void freertos_test_app(void)
{
    // Start scheduler. From this point on, execution is handled by the scheduler and 
    // only code within the tasks is run, meaning the code does not pass through the main 
    // while(1) loop anymore. 
    osKernelStart(); 
}


// Task function: main loop 
void TaskLoop(void *argument)
{
    while (1)
    {
#if PERIODIC_BLINK_TEST 
        periodic_blink_loop(); 
#elif MANUAL_BLINK_TEST 
        manual_blink_loop(); 
#elif TASK_SCHEDULING_TEST 
        task_scheduling_loop(); 
#elif MEMORY_MANAGEMENT_TEST 
        memory_management_loop(); 
#elif QUEUE_TEST 
        queue_loop(); 
#elif MUTEX_TEST 
        mutex_loop(); 
#elif SEMAPHORE_TEST 
        semaphore_loop(); 
#elif SOFTWARE_TIMER_TEST_0 
        software_timer_0_loop(); 
#elif SOFTWARE_TIMER_TEST_1 
        software_timer_1_loop(); 
#elif HARDWARE_INTERRUPT_TEST 
        hardware_interrupt_loop(); 
#elif DEADLOCK_STARVATION_TEST 
        deadlock_starvation_loop(); 
#elif PRIORITY_INVERSION_TEST 
        priority_inversion_loop(); 
#endif
    }

    vTaskDelete(NULL); 
}

//=======================================================================================


#if PERIODIC_BLINK_TEST 

// There are two tasks that both toggle the board LED but at different rates. While not 
// toggling the LED state, each task is put into the blocking state. The main loop task 
// does nothing here. 

//=======================================================================================
// Macros 

// Memory 
#define PB_STACK_SIZE configMINIMAL_STACK_SIZE * 4 

// Timing (number of ticks - default tick period is 1ms) 
#define PB_DELAY_1 500 
#define PB_DELAY_2 600 

//=======================================================================================


//=======================================================================================
// Variables 

// Task definition: blink01 
osThreadId_t blink01Handle; 
const osThreadAttr_t blink01_attributes = 
{
    .name = "blink01", 
    .stack_size = PB_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityNormal 
};

// Task definition: blink02 
osThreadId_t blink02Handle; 
const osThreadAttr_t blink02_attributes = 
{
    .name = "blink02",
    .stack_size = PB_STACK_SIZE,
    .priority = (osPriority_t) osPriorityBelowNormal 
};

// Board LED state - tasks will fight over the LED state 
static gpio_pin_state_t led_state = GPIO_LOW; 

//=======================================================================================


//=======================================================================================
// Prototypes 

/**
 * @brief Task function: blink01 
 * 
 * @param argument : NULL 
 */
void TaskBlink01(void *argument); 


/**
 * @brief Task function: blink02 
 * 
 * @param argument : NULL 
 */
void TaskBlink02(void *argument); 


/**
 * @brief LED toggle 
 * 
 * @param ticks : delay between LED toggling (ticks). See notes for info on ticks. 
 */
void blink_led_toggle(uint32_t ticks); 

//=======================================================================================


//=======================================================================================
// Setup 

void periodic_blink_init(void)
{
    // Turn the board LED off 
    gpio_write(GPIOA, GPIOX_PIN_5, led_state); 

    // Create the thread(s) 
    blink01Handle = osThreadNew(TaskBlink01, NULL, &blink01_attributes); 
    blink02Handle = osThreadNew(TaskBlink02, NULL, &blink02_attributes); 
}

//=======================================================================================


//=======================================================================================
// Loop 

void periodic_blink_loop(void)
{
    // Do nothing 
}

//=======================================================================================


//=======================================================================================
// Tasks and functions 

// Task function: blink01 
void TaskBlink01(void *argument)
{
    while (1)
    {
        blink_led_toggle(PB_DELAY_1); 
    }

    osThreadTerminate(NULL); 
}


// Task function: blink02 
void TaskBlink02(void *argument)
{
    while (1)
    { 
        blink_led_toggle(PB_DELAY_2); 
    }

    osThreadTerminate(NULL); 
}


// LED toggle 
void blink_led_toggle(uint32_t ticks)
{
    led_state = GPIO_HIGH - led_state; 
    gpio_write(GPIOA, GPIOX_PIN_5, led_state); 
    osDelay(ticks);   // Delays the specified number of ticks 
}

//=======================================================================================


#elif MANUAL_BLINK_TEST 

// There are two tasks used to control the blinking rate of an LED. The main loop task 
// will listen for user input on the serial terminal which indicates the blinking rate 
// of the LED (in ticks). If there is input then it will be read and converted to a 
// number and used to update the blink rate. The other task will toggle the LED state 
// at the rate set by the user input. 

//=======================================================================================
// Macros 

// Memory 
#define MB_STACK_SIZE configMINIMAL_STACK_SIZE * 4 

// Data 
#define MB_MIN_LED_RATE 50 

//=======================================================================================


//=======================================================================================
// Variables 

// Task definition: MB01 
osThreadId_t MB01Handle; 
const osThreadAttr_t MB01_attributes = 
{
    .name = "MB01", 
    .stack_size = MB_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityNormal 
};

// Board LED blink rate 
static uint32_t mb_ticks = MB_MIN_LED_RATE; 

//=======================================================================================


//=======================================================================================
// Prototypes 

/**
 * @brief Task function: MB01 
 * 
 * @param argument : NULL 
 */
void TaskMB01(void *argument); 

//=======================================================================================


//=======================================================================================
// Setup 

void manual_blink_init(void)
{
    // Create the thread(s) 
    MB01Handle = osThreadNew(TaskMB01, NULL, &MB01_attributes); 

    uart_sendstring(USART2, "\r\n>>> "); 
}

//=======================================================================================


//=======================================================================================
// Loop 

void manual_blink_loop(void)
{
    // This interrupt flag will be set when an idle line is detected on UART RX after 
    // receiving new data. 
    if (handler_flags.usart2_flag)
    {
        handler_flags.usart2_flag = CLEAR; 

