samdonnelly/STM32F4-driver-test/sources/app_test/freertos_test.c
        // Get the user input and update the LED blink rate 
        cb_parse(uart_dma_buff, user_in_buff, &buff_index, SERIAL_INPUT_MAX_LEN); 
        mb_ticks = (uint32_t)strtol((char *)user_in_buff, NULL, 10); 

        // Make sure rate can't go below a certain threshold to prevent this task 
        // from never running. 
        if (mb_ticks < MB_MIN_LED_RATE)
        {
            mb_ticks = MB_MIN_LED_RATE; 
        }

        uart_sendstring(USART2, "\r\n>>> "); 
    }
}

//=======================================================================================


//=======================================================================================
// Tasks and functions 

// Task function: MB01 
void TaskMB01(void *argument)
{
    // Board LED state 
    gpio_pin_state_t led_state = GPIO_LOW; 

    while (1)
    {
        led_state = GPIO_HIGH - led_state; 
        gpio_write(GPIOA, GPIOX_PIN_5, led_state); 
        osDelay(mb_ticks); 
    }

    osThreadTerminate(NULL); 
}

//=======================================================================================


#elif TASK_SCHEDULING_TEST 

// There are two tasks that both print to the serial terminal. The first task is of a 
// lower priority and prints an arbitrary string at every 1 second. The second task is 
// of a higher priority and prints an asterisks every 100 ms. The main loop task controls 
// both of these tasks by first periodically suspending task 2, then after this is done 
// a few times task 1 is deleted so that only task 2 remains running. The messages should 
// be printed at a slow baud rate to better observe the preemptive nature of the RTOS. 

//=======================================================================================
// Macros 

// Memory 
#define TS_STACK_SIZE configMINIMAL_STACK_SIZE * 4 

// Timing 
#define TS_DELAY_1 2000   // Ticks 
#define TS_DELAY_2 1000   // Ticks 
#define TS_DELAY_3 100    // Ticks 
#define TS_DELAY_4 5000   // (ms) 

//=======================================================================================


//=======================================================================================
// Variables 

// Task definition: msg01 
osThreadId_t msg01Handle = NULL; 
const osThreadAttr_t msg01_attributes = 
{
    .name = "msg01", 
    .stack_size = TS_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityBelowNormal 
};

// Task definition: msg02 
osThreadId_t msg02Handle = NULL; 
const osThreadAttr_t msg02_attributes = 
{
    .name = "msg02",
    .stack_size = TS_STACK_SIZE,
    .priority = (osPriority_t) osPriorityNormal 
};

// Strings 
const char msg[] = "Barkadeer brig Arr booty rum"; 

//=======================================================================================


//=======================================================================================
// Prototypes 

/**
 * @brief Task function: msg01 
 * 
 * @param argument : NULL 
 */
void TaskMsg01(void *argument); 


/**
 * @brief Task function: msg02 
 * 
 * @param argument : NULL 
 */
void TaskMsg02(void *argument); 

//=======================================================================================


//=======================================================================================
// Setup 

void task_scheduling_init(void)
{
    // Reinitialize UART (serial terminal output) for a slower baud rate 
    uart_init(
        USART2, 
        GPIOA, 
        PIN_3, 
        PIN_2, 
        UART_FRAC_42_1200, 
        UART_MANT_42_1200, 
        UART_DMA_DISABLE, 
        UART_DMA_DISABLE); 

    // Create the thread(s) 
    msg01Handle = osThreadNew(TaskMsg01, NULL, &msg01_attributes); 
    msg02Handle = osThreadNew(TaskMsg02, NULL, &msg02_attributes); 

    // Blocking delay to provide time for the user to connect to the serial terminal 
    tim_delay_ms(TIM9, TS_DELAY_4); 
}

//=======================================================================================


//=======================================================================================
// Loop 

void task_scheduling_loop(void)
{
    // Suspend the higher priority task for some intervals 
    for (uint8_t i = CLEAR; i < 3; i++)
    {
        osThreadSuspend(msg02Handle); 
        osDelay(TS_DELAY_1); 
        osThreadResume(msg02Handle); 
        osDelay(TS_DELAY_1); 
    }
    
    // Delete the lower priority task 
    if (msg01Handle != NULL)
    {
        osThreadTerminate(msg01Handle); 
        msg01Handle = NULL; 
    }
}

//=======================================================================================


//=======================================================================================
// Tasks and functions 

// Task function: msg01 
void TaskMsg01(void *argument)
{
    // Print the string to the terminal one character at a time. 
    while (1)
    {
        uart_send_new_line(USART2); 
        uart_sendstring(USART2, msg); 
        uart_send_new_line(USART2); 
        osDelay(TS_DELAY_2); 
    }

    osThreadTerminate(NULL); 
}


// Task function: msg02 
void TaskMsg02(void *argument)
{
    while (1)
    {
        uart_sendchar(USART2, AST_CHAR); 
        osDelay(TS_DELAY_3); 
    }

    osThreadTerminate(NULL); 
}

//=======================================================================================


#elif MEMORY_MANAGEMENT_TEST 

// This test uses two tasks to mimic a serial echo program. One task listens and records 
// input from the serial terminal. Once the end of the input is seen (new line or 
// carriage return), all the input up to that point gets stored in allocated heap memory 
// and informs the second task that there is new data. The second task prints the input 
// message back to there terminal when it becomes available and frees the memory used to 
// store the message. 

//=======================================================================================
// Macros 

// Memory 
#define MM_STACK_SIZE configMINIMAL_STACK_SIZE * 4 

// Data 
#define MM_STR_MAX_LEN 100 

//=======================================================================================


//=======================================================================================
// Variables 

// Task definition: MM01 
osThreadId_t MM01Handle; 
const osThreadAttr_t MM01_attributes = 
{
    .name = "MM01", 
    .stack_size = MM_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityNormal 
};

