samdonnelly/STM32F4-driver-test/sources/app_test/freertos_test.c
// Pointer used to locate heap allocated memory 
static char *user_msg = NULL; 

//=======================================================================================


//=======================================================================================
// Prototypes 

/**
 * @brief Task function: MM01 
 * 
 * @param argument : NULL 
 */
void TaskMM01(void *argument); 

//=======================================================================================


//=======================================================================================
// Setup 

void memory_management_init(void)
{
    // Create the thread(s) 
    MM01Handle = osThreadNew(TaskMM01, NULL, &MM01_attributes); 
    osThreadSuspend(MM01Handle);   // Suspend to prevent running right away 

    uart_sendstring(USART2, "\r\n>>> "); 
}

//=======================================================================================


//=======================================================================================
// Loop 

void memory_management_loop(void)
{
    // This interrupt flag will be set when an idle line is detected on UART RX after 
    // receiving new data. 
    if (handler_flags.usart2_flag)
    {
        handler_flags.usart2_flag = CLEAR; 

        uint8_t user_in_buff_local[SERIAL_INPUT_MAX_LEN]; 
        uint32_t input_len; 
        uint8_t mem_info[MM_STR_MAX_LEN]; 

        // Get the user input from the circular buffer 
        cb_parse(uart_dma_buff, user_in_buff_local, &buff_index, SERIAL_INPUT_MAX_LEN); 

        snprintf(
            (char *)mem_info, 
            MM_STR_MAX_LEN, 
            "Free task stack (words): %lu\r\nFree heap before malloc (bytes): %lu\r\n", 
            (uint32_t)uxTaskGetStackHighWaterMark(NULL), 
            (uint32_t)xPortGetFreeHeapSize()); 
        uart_sendstring(USART2, (char *)mem_info); 

        // Store the input in heap memory. 'input_len' is made one longer than strlen 
        // provides so that the null termination of 'user_in_buff_local' will be 
        // copied to the heap and print properly to the serial terminal. 
        input_len = (uint32_t)strlen((char *)user_in_buff_local) + 1; 
        user_msg = (char *)pvPortMalloc(input_len); 

        if (user_msg != NULL)
        {
            memcpy((void *)user_msg, (void *)user_in_buff_local, input_len); 
        }

        snprintf(
            (char *)mem_info, 
            MM_STR_MAX_LEN, 
            "Free heap after malloc (bytes): %lu\r\n", 
            (uint32_t)xPortGetFreeHeapSize()); 
        uart_sendstring(USART2, (char *)mem_info); 

        osThreadResume(MM01Handle); 
    }
}

//=======================================================================================


//=======================================================================================
// Tasks and functions 

// Task function: MM01 
void TaskMM01(void *argument)
{
    while (1)
    {
        // Echo the user input back to the serial terminal 
        uart_sendstring(USART2, "Echo: "); 
        uart_sendstring(USART2, user_msg); 
        uart_sendstring(USART2, "\r\n\n>>> "); 

        // Free the heap memory and suspend the task 
        vPortFree(user_msg); 
        user_msg = NULL; 
        osThreadSuspend(MM01Handle); 
    }

    osThreadTerminate(NULL); 
}

//=======================================================================================


#elif QUEUE_TEST 

// This test has two tasks and two queues. Task A will read serial terminal input from 
// the user and echo it back to the terminal, print new messages from queue 2 and if 
// "delay <value>" is input by the user then send <value> to queue 1. Task B will 
// update a variable with any new values from queue 1, use the value of this variable 
// to control the blink rate/delay of the board LED, and send the number of times the 
// LED has blinked 100 times to queue 2. 

//=======================================================================================
// Macros 

// Memory 
#define QUEUE_STACK_SIZE configMINIMAL_STACK_SIZE * 4 

// Data 
#define QUEUE_MIN_LED_RATE 50 

//=======================================================================================


//=======================================================================================
// Variables 

// Task definition: queue01 
osThreadId_t queue01Handle; 
const osThreadAttr_t queue01_attributes = 
{
    .name = "queue01", 
    .stack_size = QUEUE_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityNormal 
};

// Queue info 
static const uint8_t msg_queue_len = 5; 
static QueueHandle_t msg_queue_0; 
static QueueHandle_t msg_queue_1; 

//=======================================================================================


//=======================================================================================
// Prototypes 

/**
 * @brief Task function: queue01 
 * 
 * @param argument : NULL 
 */
void TaskQueue01(void *argument); 

//=======================================================================================


//=======================================================================================
// Setup 

void queue_init(void)
{
    // Create the thread(s) 
    queue01Handle = osThreadNew(TaskQueue01, NULL, &queue01_attributes); 

    // Create queue handle(s) 
    msg_queue_0 = xQueueCreate(msg_queue_len, sizeof(uint32_t)); 
    msg_queue_1 = xQueueCreate(msg_queue_len, sizeof(uint32_t)); 

    uart_sendstring(USART2, "\r\n>>> "); 
}

//=======================================================================================


//=======================================================================================
// Loop 

void queue_loop(void)
{
    static uint32_t blink_count = CLEAR; 

    // This interrupt flag will be set when an idle line is detected on UART RX after 
    // receiving new data. 
    if (handler_flags.usart2_flag)
    {
        handler_flags.usart2_flag = CLEAR; 

        // Get the user input from the circular buffer 
        cb_parse(uart_dma_buff, user_in_buff, &buff_index, SERIAL_INPUT_MAX_LEN); 
        
