samdonnelly/STM32F4-driver-test/sources/app_test/freertos_test.c
        // Check for a valid delay command. If found then updated the LED delay rate. 
        if (str_compare("delay ", (char *)user_in_buff, BYTE_0))
        {
            char *delay_value_cmd = (char *)(user_in_buff + BYTE_6); 
            uint32_t delay_value = (uint32_t)strtol(delay_value_cmd, NULL, 10); 

            if (delay_value != 0)
            {
                if (delay_value < QUEUE_MIN_LED_RATE)
                {
                    delay_value = QUEUE_MIN_LED_RATE; 
                }

                // Send delay value to queue 0 
                if (xQueueSend(msg_queue_0, (void *)&delay_value, 0) == pdTRUE)
                {
                    char delay_value_str[SERIAL_INPUT_MAX_LEN]; 
                    snprintf(
                        delay_value_str, 
                        SERIAL_INPUT_MAX_LEN, 
                        "Blink delay (ms): %lu", 
                        delay_value); 
                    uart_sendstring(USART2, delay_value_str); 
                    uart_send_new_line(USART2); 
                }
                else 
                {
                    uart_sendstring(USART2, "Queue full.\n"); 
                }

            }
        }

        uart_sendstring(USART2, "\r\n>>> "); 
    }

    // Print new messages from queue 1 
    if (xQueueReceive(msg_queue_1, (void *)&blink_count, 0) == pdTRUE)
    {
        char blink_count_str[SERIAL_INPUT_MAX_LEN]; 
        snprintf(
            blink_count_str, 
            SERIAL_INPUT_MAX_LEN, 
            "\rBlink count (x100): %lu\n", 
            blink_count); 
        uart_sendstring(USART2, blink_count_str); 
        uart_sendstring(USART2, "\r\n>>> "); 
    }
}

//=======================================================================================


//=======================================================================================
// Tasks and functions 

// Task function: queue01 
void TaskQueue01(void *argument)
{
    uint32_t delay = QUEUE_MIN_LED_RATE, blink_count = CLEAR, blink_tally = CLEAR; 
    gpio_pin_state_t led_state = GPIO_LOW; 

    while (1)
    {
        led_state = GPIO_HIGH - led_state; 
        gpio_write(GPIOA, GPIOX_PIN_5, led_state); 
        blink_count += (uint32_t)led_state; 

        if (blink_count >= 100)
        {
            blink_count = CLEAR; 
            blink_tally++; 
            xQueueSend(msg_queue_1, (void *)&blink_tally, 0); 
        }

        xQueueReceive(msg_queue_0, (void *)&delay, 0); 
        osDelay(delay); 
    }

    osThreadTerminate(NULL); 
}

//=======================================================================================


#elif MUTEX_TEST 

// There are two tasks that both increment the same counter using the same function call. 
// There is a mutex that prevents the other task from running while the current task 
// increments the counter. 

//=======================================================================================
// Macros 

// Memory 
#define MUTEX_STACK_SIZE configMINIMAL_STACK_SIZE * 4 

// Timing 
#define MUTEX_DELAY_1 1000   // Ticks 
#define MUTEX_DELAY_2 1500   // Ticks 

//=======================================================================================


//=======================================================================================
// Variables 

// Task definition: increment01 
osThreadId_t increment01Handle; 
const osThreadAttr_t increment01_attributes = 
{
    .name = "increment01", 
    .stack_size = MUTEX_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityNormal 
};

// Task definition: increment02 
osThreadId_t increment02Handle; 
const osThreadAttr_t increment02_attributes = 
{
    .name = "increment02",
    .stack_size = MUTEX_STACK_SIZE,
    .priority = (osPriority_t) osPriorityBelowNormal 
};

// Shared task counter 
static uint16_t counter_shared = CLEAR; 

// Mutex 
static SemaphoreHandle_t mutex; 

//=======================================================================================


//=======================================================================================
// Prototypes 

/**
 * @brief Task function: increment01 
 * 
 * @param argument : NULL 
 */
void TaskInc01(void *argument); 


/**
 * @brief Task function: increment02 
 * 
 * @param argument : NULL 
 */
void TaskInc02(void *argument); 


/**
 * @brief Increment counter 
 * 
 * @param delay : task delay time (ticks) 
 */
void increment_counter(uint16_t delay); 

//=======================================================================================


//=======================================================================================
// Setup 

void mutex_init(void)
{
    // Create the thread(s) 
    increment01Handle = osThreadNew(TaskInc01, NULL, &increment01_attributes); 
    increment02Handle = osThreadNew(TaskInc02, NULL, &increment02_attributes); 

    // Create the mutex 
    mutex = xSemaphoreCreateMutex(); 
}

//=======================================================================================


//=======================================================================================
// Loop 

void mutex_loop(void)
{
    // Do nothing 
}

//=======================================================================================


//=======================================================================================
// Tasks and functions 

// Task function: increment01 
void TaskInc01(void *argument)
{
    while (1)
    {
        increment_counter(MUTEX_DELAY_1); 
    }

    osThreadTerminate(NULL); 
}


// Task function: increment02 
void TaskInc02(void *argument)
{
    while (1)
    {
        increment_counter(MUTEX_DELAY_2); 
    }

    osThreadTerminate(NULL); 
}


// Increment counter 
void increment_counter(uint16_t delay)
{
    static uint16_t counter_temp = CLEAR; 

    // Take mutex prior to critical section 
    if (xSemaphoreTake(mutex, 0) == pdTRUE)
    {
        // Purposely increment in a non-efficient manner 
        counter_temp = counter_shared; 
        counter_temp++; 
        osDelay(delay); 
        counter_shared = counter_temp; 

        char num_str[SERIAL_INPUT_MAX_LEN]; 
        snprintf(num_str, SERIAL_INPUT_MAX_LEN, "%u\r\n", counter_shared); 
        uart_sendstring(USART2, num_str); 

        // Give mutex back after critical section 
        xSemaphoreGive(mutex); 
    }
    else 
    {
        // Do something useful if the critical section cannot be accessed. 
    }
}

//=======================================================================================


