samdonnelly/STM32F4-driver-test/sources/app_test/freertos_test.c
#elif SEMAPHORE_TEST 

// There are 5 producer tasks that write to a circular buffer and 2 consumer tasks that 
// read from it. The producer tasks write their task number to the buffer 3 times and 
// the consumers print the contents of the buffer to the serial terminal. The serial 
// terminal output should display each task number exactly 3 times and have one number 
// output per line, meaning access to the buffer, the state of the buffer and the serial 
// line must be protected from multiple accesse. Protection is accomplished by a mutex 
// to protect the buffer and serial line as well as two counting semaphores, one for 
// the number of empty buffer slots and one for the number of full buffer slots, that 
// prevent overwriting and overreading the buffer. Each producer task should be created, 
// copy its task number passed as the task argument to a local variable, run once and 
// then deleted itself. 

//=======================================================================================
// Macros 

// Memory 
#define SEMAPHORE_STACK_SIZE configMINIMAL_STACK_SIZE * 4 

// Data 
#define SEMAPHORE_NUM_PRODUCERS 5 
#define SEMAPHORE_NUM_CONSUMERS 2 
#define SEMAPHORE_NUM_WRITES 3 
#define SEMAPHORE_BUFF_SIZE 5 
#define SEMAPHORE_TASK_NAME_LEN 15 

// Timing 
#define SEMPAHORE_DELAY_1 5000   // (ms) 

//=======================================================================================


//=======================================================================================
// Variables 

// Task definition: increment01 
osThreadId_t semaphoreSetupHandle; 
const osThreadAttr_t semaphoreSetup_attributes = 
{
    .name = "semaphoreSetup", 
    .stack_size = SEMAPHORE_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityNormal 
};

// Semaphores 
static SemaphoreHandle_t binary_sem;   // Allows for parameter copying 
static SemaphoreHandle_t filled_sem;   // Number of filled slots in the circular buffer 
static SemaphoreHandle_t empty_sem;    // Number of empty slots in the circular buffer 

// Mutex 
static SemaphoreHandle_t buff_mutex;   // Protects the circular buffer and serial output 

// Data 
static uint8_t buff[SEMAPHORE_BUFF_SIZE];  // Circular buffer 
static uint8_t write_index = CLEAR;        // Write/head index for circular buffer 
static uint8_t read_index = CLEAR;         // Read/tail index for circular buffer 

//=======================================================================================


//=======================================================================================
// Prototypes 

/**
 * @brief Task function: semaphoreSetup 
 * 
 * @param argument : NULL 
 */
void TaskSemaphoreSetup(void *argument); 


/**
 * @brief Task function: semaphoreProducer 
 * 
 * @param argument : NULL 
 */
void TaskSemaphoreProducer(void *argument); 


/**
 * @brief Task function: semaphoreConsumer 
 * 
 * @param argument : NULL 
 */
void TaskSemaphoreConsumer(void *argument); 

//=======================================================================================


//=======================================================================================
// Setup 

void semaphore_init(void)
{
    // Create the thread(s) 
    semaphoreSetupHandle = osThreadNew(TaskSemaphoreSetup, NULL, &semaphoreSetup_attributes); 

    // Create semaphore(s) 
    binary_sem = xSemaphoreCreateBinary(); 
    filled_sem = xSemaphoreCreateCounting(SEMAPHORE_BUFF_SIZE, 0); 
    empty_sem = xSemaphoreCreateCounting(SEMAPHORE_BUFF_SIZE, SEMAPHORE_BUFF_SIZE); 

    // Create mutex 
    buff_mutex = xSemaphoreCreateMutex(); 

    // Blocking delay to provide time for the user to connect to the serial terminal 
    tim_delay_ms(TIM9, SEMPAHORE_DELAY_1); 
}

//=======================================================================================


//=======================================================================================
// Loop 

void semaphore_loop(void)
{
    // Do nothing 
}

//=======================================================================================


//=======================================================================================
// Tasks and functions 

// Task function: semaphoreSetup 
void TaskSemaphoreSetup(void *argument)
{
    char task_name[SEMAPHORE_TASK_NAME_LEN]; 

    // Create and start producer threads 
    for (uint8_t i = CLEAR; i < SEMAPHORE_NUM_PRODUCERS; i++)
    {
        snprintf(task_name, SEMAPHORE_TASK_NAME_LEN, "producer-%u", i); 

        const osThreadAttr_t producer_attributes = 
        {
            .name = task_name, 
            .stack_size = SEMAPHORE_STACK_SIZE, 
            .priority = (osPriority_t) osPriorityNormal 
        };

        // Tasks delete themselves after executing the task function 
        osThreadNew(TaskSemaphoreProducer, (void *)&i, &producer_attributes); 

        // Wait for each task to read the argument 
        xSemaphoreTake(binary_sem, portMAX_DELAY); 
    }

    // Create and start consumer threads 
    for (uint8_t i = CLEAR; i < SEMAPHORE_NUM_CONSUMERS; i++)
    {
        snprintf(task_name, SEMAPHORE_TASK_NAME_LEN, "consumer-%i", i); 

        const osThreadAttr_t consumer_attributes = 
        {
            .name = task_name, 
            .stack_size = SEMAPHORE_STACK_SIZE, 
            .priority = (osPriority_t) osPriorityNormal 
        };

        osThreadNew(TaskSemaphoreConsumer, NULL, &consumer_attributes); 
    }

    while (1) {} 

    // Delete the task 
    osThreadTerminate(NULL); 
}


// Task function: semaphoreProducer 
void TaskSemaphoreProducer(void *argument)
{
    // Copy 'argument' into a local variable 
    uint8_t num = *(uint8_t *)argument; 

    // Release the binary semaphore 
    xSemaphoreGive(binary_sem); 

    // Fill the shared buffer with the task number 3 times 
    for (uint8_t i = CLEAR; i < SEMAPHORE_NUM_WRITES; i++)
    {
        // Critical section 

        xSemaphoreTake(empty_sem, portMAX_DELAY); 
        xSemaphoreTake(buff_mutex, portMAX_DELAY); 

        buff[write_index] = num; 
        write_index = (write_index + 1) % SEMAPHORE_BUFF_SIZE; 

