samdonnelly/STM32F4-driver-test/sources/app_test/freertos_test.c
        xSemaphoreGive(buff_mutex); 
        xSemaphoreGive(filled_sem); 
    }

    // Delete the task 
    osThreadTerminate(NULL); 

    // This loop does not execute 
    while (1) {}
}


// Task function: semaphoreConsumer 
void TaskSemaphoreConsumer(void *argument)
{
    uint8_t val; 

    // Read from the buffer 
    while (1)
    {
        // Critical section 

        xSemaphoreTake(filled_sem, portMAX_DELAY); 
        xSemaphoreTake(buff_mutex, portMAX_DELAY); 

        val = buff[read_index]; 
        read_index = (read_index + 1) % SEMAPHORE_BUFF_SIZE; 
        uart_send_integer(USART2, (int16_t)val); 
        uart_send_new_line(USART2); 

        xSemaphoreGive(buff_mutex); 
        xSemaphoreGive(empty_sem); 
    }

    osThreadTerminate(NULL); 
}

//=======================================================================================


#elif SOFTWARE_TIMER_TEST_0

// There are two software timers, one is a one-shot and the other is a repeat. Both 
// timers have the same callback function that will display which timer has expired 
// in the serial terminal. 

//=======================================================================================
// Macros 

// Timing 
#define SOFTWARE_TIMER_0_DELAY_1 1000    // ms 
#define SOFTWARE_TIMER_0_PERIOD_1 1000   // Ticks 
#define SOFTWARE_TIMER_0_PERIOD_2 2000   // Ticks 

//=======================================================================================


//=======================================================================================
// Variables 

// Timer(s) - FreeRTOS API method 
static TimerHandle_t one_shot_timer = NULL; 
static TimerHandle_t auto_reload_timer = NULL; 

// Timer(s) - CMSIS API method 
// static osTimerId_t oneShotTimerHandle; 
// const osTimerAttr_t oneShot_attributes = { .name = "oneShotTimer" }; 

//=======================================================================================


//=======================================================================================
// Prototypes 

/**
 * @brief Called when one of the timers expires 
 * 
 * @param xTimer : software timer ID 
 */
void myTimerCallback(TimerHandle_t xTimer); 

//=======================================================================================


//=======================================================================================
// Setup 

void software_timer_0_init(void)
{
    //==================================================
    // FreeRTOS API method 

    // Create timers 
    one_shot_timer = xTimerCreate(
        "one_shot_timer",               // Name of timer 
        SOFTWARE_TIMER_0_PERIOD_1,      // Period of timer (ticks) 
        pdFALSE,                        // Auto-relead --> pdFASLE == One Shot Timer 
        (void *)0,                      // Timer ID 
        myTimerCallback);               // Callback function 
    
    auto_reload_timer = xTimerCreate(
        "auto_reload_timer",            // Name of timer 
        SOFTWARE_TIMER_0_PERIOD_2,      // Period of timer (ticks) 
        pdTRUE,                         // Auto-relead --> pdTRUE == Repeat Timer 
        (void *)1,                      // Timer ID 
        myTimerCallback);               // Callback function 

    // Check that the timers were created properly 
    if ((one_shot_timer == NULL) || (auto_reload_timer == NULL))
    {
        uart_sendstring(USART2, "Couldn't create at least one of the timers.\r\n"); 
    }
    else 
    {
        tim_delay_ms(TIM9, SOFTWARE_TIMER_0_DELAY_1); 
        uart_sendstring(USART2, "Starting timers...\r\n"); 

        // Start timers (max block time if command queue is full). 
        // Essentially says to wait forever if the queue is full. 
        xTimerStart(one_shot_timer, portMAX_DELAY); 
        xTimerStart(auto_reload_timer, portMAX_DELAY); 
    }
    
    //==================================================

    //==================================================
    // CMSIS API method 

    // Note that using this function doesn't allow you to adjust the period of the timer. 
    // oneShotTimerHandle = osTimerNew(myTimerCallback, osTimerOnce, NULL, &oneShot_attributes); 
    // osTimerStart(oneShotTimerHandle, 1); 
    
    //==================================================
}

//=======================================================================================


//=======================================================================================
// Loop 

void software_timer_0_loop(void)
{
    // Yield the main loop task to the lower priority software timers. 
    osDelay(SOFTWARE_TIMER_0_DELAY_1); 
}

//=======================================================================================


//=======================================================================================
// Tasks and functions 

// Called when one of the timers expires 
void myTimerCallback(TimerHandle_t xTimer)
{
    // The 'xTimer' parameter can be used to identify which timer called this function 
    // when multiple timers call this function. 

    // Print message if timer 0 expired 
    if ((uint32_t)pvTimerGetTimerID(xTimer) == 0)
    {
        uart_sendstring(USART2, "One-shot timer expired.\r\n"); 
    }

    // Print message if timer 1 expired 
    if ((uint32_t)pvTimerGetTimerID(xTimer) == 1)
    {
        uart_sendstring(USART2, "Auto-reload timer expired. Reloading...\r\n"); 
    }
}

//=======================================================================================


#elif SOFTWARE_TIMER_TEST_1 

// Use the board LED to simulate a backlight display. When characters are entered in 
// the serial terminal (doesn't matter what), the LED lights up as if we're interfacing 
// with a screen menu. Turn the LED off after 5 second of no input (inactivity). Use a 
// software timer to accomplish this. Hint: xTimerStart will restart a counter if it's 
// called before the timer expires. 

//=======================================================================================
// Macros 

// Memory 
#define SOFTWARE_TIMER_STACK_SIZE configMINIMAL_STACK_SIZE * 4 

