samdonnelly/STM32F4-driver-test/sources/app_test/freertos_test.c
// Timing 
#define SOFTWARE_TIMER_1_DELAY_1 1000   // ms 
#define SOFTWARE_TIMER_1_DELAY_2 5      // ms
#define SOFTWARE_TIMER_1_PERIOD 5000    // ticks 

//=======================================================================================


//=======================================================================================
// Variables 

// Task definition: softwareTimer 
osThreadId_t softwareTimerHandle; 
const osThreadAttr_t softwareTimer_attributes = 
{
    .name = "softwareTimer",
    .stack_size = SOFTWARE_TIMER_STACK_SIZE,
    .priority = (osPriority_t) osPriorityNormal 
};

// Timer(s) 
static TimerHandle_t display_timer = NULL; 

//=======================================================================================


//=======================================================================================
// Prototypes 

/**
 * @brief Task function: softwareTimer 
 * 
 * @param argument : NULL 
 */
void TaskSoftwareTimer(void *argument); 


/**
 * @brief Called when the display sees no activity 
 * 
 * @param argument : NULL 
 */
void DisplayBacklightCallback(TimerHandle_t argument); 

//=======================================================================================


//=======================================================================================
// Setup 

void software_timer_1_init(void)
{
    // Create the thread(s) 
    softwareTimerHandle = osThreadNew(TaskSoftwareTimer, NULL, &softwareTimer_attributes); 

    // Create timer(s) 
    display_timer = xTimerCreate(
        "display_backlight_timer",      // Name of timer 
        SOFTWARE_TIMER_1_PERIOD,        // Period of timer (ticks) 
        pdFALSE,                        // Auto-relead --> pdFASLE == One Shot Timer 
        NULL,                           // Timer ID 
        DisplayBacklightCallback);      // Callback function 
}

//=======================================================================================


//=======================================================================================
// Loop 

void software_timer_1_loop(void)
{
    // This interrupt flag will be set when an idle line is detected on UART RX after 
    // receiving new data. 
    if (handler_flags.usart2_flag)
    {
        handler_flags.usart2_flag = CLEAR; 
        uart_sendstring(USART2, ">>> "); 

        // Restart the display timeout and turn the board LED on 
        xTimerStart(display_timer, portMAX_DELAY); 
        gpio_write(GPIOA, GPIOX_PIN_5, GPIO_HIGH); 
    }

    // Yield the main loop task to the lower priority software timers. 
    osDelay(SOFTWARE_TIMER_1_DELAY_2); 
}

//=======================================================================================


//=======================================================================================
// Tasks and functions 

// Task function: softwareTimer 
void TaskSoftwareTimer(void *argument)
{
    if (display_timer == NULL)
    {
        uart_sendstring(USART2, "Couldn't create timer.\r\n"); 
    }
    else 
    {
        tim_delay_ms(TIM9, SOFTWARE_TIMER_1_DELAY_1); 
        uart_sendstring(USART2, "Starting interface...\r\n>>> "); 

        // Turn the board LED on 
        gpio_write(GPIOA, GPIOX_PIN_5, GPIO_HIGH); 

        // Start timers (max block time if command queue is full). 
        xTimerStart(display_timer, portMAX_DELAY); 
    }

    osThreadTerminate(softwareTimerHandle); 
}


// Called when the display sees no activity 
void DisplayBacklightCallback(TimerHandle_t argument)
{
    // Turn the board LED off 
    gpio_write(GPIOA, GPIOX_PIN_5, GPIO_LOW); 
}

//=======================================================================================


#elif HARDWARE_INTERRUPT_TEST 

// Use a hardware timer (ISR) to sample an ADC 10 times per second (10 Hz) and store the 
// values in a double or circular buffer. A double or circular buffer is recommended so 
// data can be read/used at the same time new data gets written. Once 10 samples have 
// been collected, the ISR should wake up task A which computes the average of the 10 
// samples and stores the result in a global floating point variable. Assume this global 
// variable cannot be written to or read from in a single instruction cycle (critical 
// section). Task B will output the value of the global variable to the serial terminal 
// if "avg" is entered by the user, otherwise the input is ignored. 

//=======================================================================================
// Macros 

// Memory 
#define HARDWARE_INT_STACK_SIZE configMINIMAL_STACK_SIZE * 4 

// Data 
#define HARDWARE_INT_NUM_SAMPLES 10 

//=======================================================================================


//=======================================================================================
// Variables 

// Task definition: hardwareInterrupt01 
osThreadId_t hardwareInterrupt01Handle; 
const osThreadAttr_t hardwareInterrupt01_attributes = 
{
    .name = "hardwareInterrupt01", 
    .stack_size = HARDWARE_INT_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityNormal 
};

// Data 
static double avg = CLEAR; 
static volatile uint16_t adc_result[2][HARDWARE_INT_NUM_SAMPLES]; 
static uint8_t write_index = CLEAR; 
static uint8_t read_index = SET_BIT; 

// Semaphore(s) and Mutex 
static SemaphoreHandle_t binary_sem_0; 
static SemaphoreHandle_t binary_sem_1; 
static SemaphoreHandle_t mutex; 

//=======================================================================================


//=======================================================================================
// Prototypes 

/**
 * @brief Task function: hardwareInterrupt 
 * 
 * @param argument : NULL 
 */
void TaskHardwareInterrupt(void *argument); 

//=======================================================================================


//=======================================================================================
// Setup 

void hardware_interrupt_init(void)
{
    // Re-define timer 9 to be a periodic (counter update) interrupt timer 
    tim_disable(TIM9); 
    tim_9_to_11_counter_init(
        TIM9, 
        TIM_84MHZ_100US_PSC, 
        0x03E8,  // ARR=1000, (1000 counts)*(100us/count) = 100ms 
        TIM_UP_INT_ENABLE); 
    tim_enable(TIM9); 

    // Enable the interrupt handlers. This interrupt calls interrupt safe FreeRTOS API 
    // functions so it has to have a lower (numerically higher) priority than 
    // 'configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY' in 'FreeRTOSConfig.h'. 
    nvic_config(TIM1_BRK_TIM9_IRQn, EXTI_PRIORITY_7); 

    // Initialize the ADC port, pin and read sequence 
    adc1_clock_enable(RCC); 
    adc_port_init(
        ADC1, 
        ADC1_COMMON, 
        ADC_PCLK2_4, 
        ADC_RES_8, 
        ADC_PARAM_ENABLE, 
        ADC_PARAM_ENABLE, 
        ADC_PARAM_DISABLE, 
        ADC_PARAM_DISABLE, 
        ADC_PARAM_DISABLE, 
        ADC_PARAM_DISABLE, 
        ADC_PARAM_DISABLE); 
    adc_pin_init(ADC1, GPIOC, PIN_0, ADC_CHANNEL_10, ADC_SMP_15); 
    adc_seq(ADC1, ADC_CHANNEL_10, ADC_SEQ_1); 
    adc_on(ADC1); 

    // Create the thread(s) 
    hardwareInterrupt01Handle = osThreadNew(
        TaskHardwareInterrupt, NULL, &hardwareInterrupt01_attributes); 

    // Create semaphore(s) and mutex 
    binary_sem_0 = xSemaphoreCreateBinary();   // Indicates when samples can be averaged 
    binary_sem_1 = xSemaphoreCreateBinary();   // Controls double buffer read/write index 
    mutex = xSemaphoreCreateMutex();           // Protects 'avg' 

    // We give the buffer index semaphore immediately to avoid the initial conflict 
    // between updating the double buffer index and averaging the first sample of 10. 
    xSemaphoreGive(binary_sem_1); 

    uart_sendstring(USART2, ">>> "); 
}

//=======================================================================================


//=======================================================================================
// Loop 

void hardware_interrupt_loop(void)
{
    // This interrupt flag will be set when an idle line is detected on UART RX after 
    // receiving new data. 
    if (handler_flags.usart2_flag)
    {
        handler_flags.usart2_flag = CLEAR; 

        // Get the user input from the circular buffer 
        cb_parse(uart_dma_buff, user_in_buff, &buff_index, SERIAL_INPUT_MAX_LEN); 

        // Check for the average command by checking that the input is exactly "avg". 
        if (strlen((char *)user_in_buff) == 3)
        {
            char avg_str[SERIAL_INPUT_MAX_LEN]; 

            if (str_compare("avg", (char *)user_in_buff, BYTE_0))
            {
                // Display the average and protect 'avg' so it cannot be updated during 
                // the serial output process. 
                xSemaphoreTake(mutex, portMAX_DELAY); 
                snprintf(
                    avg_str, 
                    SERIAL_INPUT_MAX_LEN, 
                    "Average: %u.%u\r\n", 
                    (uint16_t)avg, 
                    (uint16_t)(avg * SCALE_10) % DIVIDE_10); 
                xSemaphoreGive(mutex); 
                uart_sendstring(USART2, avg_str); 
            }
        }

        uart_sendstring(USART2, ">>> "); 
    }
}

//=======================================================================================


//=======================================================================================
// Tasks and functions 

// Task function: hardwareInterrupt 
void TaskHardwareInterrupt(void *argument)
{
    while (1)
    {
        // Waits for indication from the ISR that 10 samples have been read before 
        // proceeding to average the samples. 
        xSemaphoreTake(binary_sem_0, portMAX_DELAY); 

