samdonnelly/STM32F4-driver-test/sources/app_test/freertos_test.c
        // Compute the average of 10 samples in the part of the double buffer not 
        // being written to by the ISR. 
        uint32_t sum = CLEAR; 
        for (uint8_t i = CLEAR; i < HARDWARE_INT_NUM_SAMPLES; i++)
        {
            sum += (uint32_t)adc_result[read_index][i]; 
        }

        // Allow for read and write section indexes of the double buffer to be updated 
        // in the ISR now that averaging is done. 
        xSemaphoreGive(binary_sem_1); 

        // Protect 'avg' so it can't be used for serial terminal output at the same 
        // time. 
        xSemaphoreTake(mutex, portMAX_DELAY); 
        avg = (double)sum / DIVIDE_10; 
        xSemaphoreGive(mutex); 
        // Could also use vPortEnterCritical and vPortExitCritical here to diable 
        // interrupts for the critical section. 
    }

    osThreadTerminate(NULL); 
}


// Timer 1 break + timer 9 global interrupt - overridden 
void TIM1_BRK_TIM9_IRQHandler(void)
{
    static uint8_t adc_index = CLEAR; 
    BaseType_t task_woken = pdFALSE; 

    // ADC read 
    adc_result[write_index][adc_index++] = adc_read_single(ADC1, ADC_CHANNEL_10); 

    if (adc_index >= HARDWARE_INT_NUM_SAMPLES)
    {
        adc_index = CLEAR; 

        // If averaging is still happening then don't swap the read and write sections 
        // and restart the 10 samples. This can be handled in multiple different ways 
        // such as blocking only one sample at a time. 
        if (xSemaphoreTakeFromISR(binary_sem_1, &task_woken) == pdTRUE)
        {
            read_index = write_index; 
            write_index = SET_BIT - write_index; 
        }
        // Can output a message if data is dropped to help see what's going on. 

        // Give the semaphore to wake up the averaging task (tell it that data is ready). 
        // This sepcial ISR API function will never block since this is not a task. There 
        // are also FreeRTOS ISR functions for directly notifying tasks which could have 
        // been used instead. 
        xSemaphoreGiveFromISR(binary_sem_0, &task_woken); 
    }

    // The following is needed to exit the ISR 
    tim_uif_clear(TIM1); 
    tim_uif_clear(TIM9); 

    // Exit from ISR - if 'task_woken' == 'pdTRUE' then 'portYIELD_FROM_ISR' requests a 
    // context switch to allow a higher priority task to immediately run if it's waiting 
    // on data from this ISR. 
    portYIELD_FROM_ISR(task_woken); 
}

//=======================================================================================


#elif DEADLOCK_STARVATION_TEST 

// "Dining Philosophers Problem" - based on video series 
// 5 philosophers at a table, 5 chopsticks available, one bowl of noodles. A chopstick 
// is placed in between each philosopher and a philosopher can only eat when they have 
// two chopsticks. The challenge is to find a logical way to make sure all philosophers 
// get to eat. 
// For this example, the philosophers are the tasks, the chopsticks are the semaphores 
// and mutexes, and the bowl of food is the shared resource. There are 5 tasks that all 
// call the same function which takes a left chopstick, then a right chopstick and "eats" 
// for a while (i.e. prints to the serial terminal). After it's done then the chopsticks 
// are put down and the function exits. If all philosophers get a chance to eat then a 
// "done" message will be printed to the serial terminal. To accomplish this, a hierarchy 
// solution or an arbitrator solution can be used: 
// - Hierarchy: A hierarchy (number) is assigned to the chopsticks and philosophers can 
//              pick up a chopstick next to them with the lowest number. This leaves one 
//              philosopher free to pick up two chopsticks and eat. Eventually the eating 
//              philosopher will put down the chopsticks and it will trigger a chain of 
//              eating. 
// - Arbitrator: A mutex that protects the chopsticks so only one philosopher can eat at 
//               a time. This makes the system no better than executing everything in a 
//               super loop but it's used for the sake of the problem. 

//=======================================================================================
// Macros 

// Memory 
#define DEADLOCK_STARVATION_STACK_SIZE configMINIMAL_STACK_SIZE * 4 

// Data 
#define NUM_PHILOSOPHERS 5 
#define DEADLOCK_STARVATION_TASK_NAME_LEN 15 
#define PHILOSOPHER_STR_MAX_LEN 50 

// Timing 
#define DEADLOCK_STARVATION_DELAY_1 5000   // (ms) 

//=======================================================================================


//=======================================================================================
// Variables 

// Task definition: increment01 
osThreadId_t deadlockStarvationSetupHandle; 
const osThreadAttr_t deadlockStarvationSetup_attributes = 
{
    .name = "deadlockStarvationSetup", 
    .stack_size = DEADLOCK_STARVATION_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityNormal 
};

// Semaphores 
static SemaphoreHandle_t binary_sem;                    // Wait for params to read 
static SemaphoreHandle_t finish_sem;                    // Notifies main task when done 

// Mutex 
static SemaphoreHandle_t chopstick[NUM_PHILOSOPHERS];   // Chipstick access 
static SemaphoreHandle_t serial_mutex;                  // Serial terminal protection 
static SemaphoreHandle_t arbitrator_mutex;              // Arbitrator chopstick access 

//=======================================================================================


//=======================================================================================
// Prototypes 

/**
 * @brief Task function: deadlockStarvationSetup 
 * 
 * @param argument : NULL 
 */
void TaskDeadlockStarvationSetup(void *argument); 


/**
 * @brief Task function: philosopherEat 
 * 
 * @param argument : NULL 
 */
void TaskPhilosopherEat(void *argument); 


/**
 * @brief Output philosopher strings to the serial terminal 
 * 
 * @param buff : string to output 
 */
void philosopher_output(char *buff); 

//=======================================================================================


//=======================================================================================
// Setup 

void deadlock_starvation_init(void)
{
    // Create the thread(s) 
    deadlockStarvationSetupHandle = osThreadNew(
        TaskDeadlockStarvationSetup, NULL, &deadlockStarvationSetup_attributes); 

    // Create semaphore(s) 
    binary_sem = xSemaphoreCreateBinary(); 
    finish_sem = xSemaphoreCreateCounting(NUM_PHILOSOPHERS, 0); 

    // Create mutex 
    serial_mutex = xSemaphoreCreateMutex(); 
    arbitrator_mutex = xSemaphoreCreateMutex(); 
    
    for (uint8_t i = CLEAR; i < NUM_PHILOSOPHERS; i++)
    {
        chopstick[i] = xSemaphoreCreateMutex(); 
    }

    // Blocking delay to provide time for the user to connect to the serial terminal 
    tim_delay_ms(TIM9, DEADLOCK_STARVATION_DELAY_1); 
}

//=======================================================================================


//=======================================================================================
// Loop 

